## Notebook Descritption:

This Jupyter notebook contain the solution to week 11 task from the Data Science class and mentoring class.

### Question 1: 

Create a dataframe using any method of your choice. The objective of this task is to help you become familiar and grounded in the creation of dataframes using several methods.

### Solution:

In [1]:
# Creating an empty dataframe:

#Import pandas library
import pandas as pd

df = pd.DataFrame()
df

Empty DataFrame
Columns: []
Index: []

In [3]:
#Method 1: Creating Pandas DataFrame from lists of lists.
 
# initialize the list of lists
df_data = [['John', 60], ['Sarah', 45], ['Mike', 70]]
 
# Create the pandas DataFrame
df = pd.DataFrame(df_data, columns = ['Name', 'Score'])
 
# print dataframe.
df

    Name  Score
0   John     60
1  Sarah     45
2   Mike     70

In [4]:
#Method 2: Creating DataFrame from dict of narray/lists

# initialize data of lists.
df_data = {'Name':['John', 'Sarah', 'Mike', 'Freda'],
        'Score':[60, 45, 70, 50]}
 
# Create DataFrame
df = pd.DataFrame(df_data)
 
# Print the output.
df

    Name  Age
0   John   60
1  Sarah   45
2   Mike   70
3  Freda   50

In [5]:
#Method 3: Creates a indexes DataFrame using arrays.

# initialize data of lists.
df_data = {'Name':['John', 'Sarah', 'Mike', 'Freda'],
        'Score':[70, 65, 60, 50]}
 
# Creates pandas DataFrame.
df = pd.DataFrame(df_data, index =['First Position',
                                'Second Position',
                                'Third Position',
                                'Fourth Position'])
 
# print the data
df

                  Name  Score
First Position    John     70
Second Position  Sarah     65
Third Position    Mike     60
Fourth Position  Freda     50

In [7]:
#Method 4: Creating Dataframe from list of dicts:

# Initialize data to lists.
df_data = [{'Apples': 100, 'Oranges': 20, 'Mangoes':45},
        {'Apples':63, 'Oranges': 120, 'Mangoes': 7}]
 
# Creates DataFrame.
df = pd.DataFrame(df_data)
 
# Print the data
df

   Apples  Oranges  Mangoes
0     100       20       45
1      63      120        7

In [39]:
#Method 6: Creating DataFrame from Dicts of series:

# Initialize data to Dicts of series.
df_data = {'Record 1' : pd.Series([45, 77, 40, 85],
                       index =['Peter', 'Paul', 'Mike', 'Jane']),
      'Record 2' : pd.Series([16, 50, 84, 23],
                        index =['Peter', 'Paul', 'Mike', 'Jane'])}
 
# creates Dataframe.
df = pd.DataFrame(df_data)
 
# print the data.
df

       Record 1  Record 2
Peter        45        16
Paul         77        50
Mike         40        84
Jane         85        23

### Question 2: Practice renaming of columns

Rename the columns of your dataframe

### Solution

In [40]:
# Method 1

df.rename(columns = {'Record 1': 'Math Score', 'Record 2': 'Phy Score'}, inplace = True)

df

       Math Score  Phy Score
Peter          45         16
Paul           77         50
Mike           40         84
Jane           85         23

In [41]:
# Method 2

df.columns = ['Math_Score', 'Phy_Score']

df

       Math_Score  Phy_Score
Peter          45         16
Paul           77         50
Mike           40         84
Jane           85         23

### Question 3: Add a new column to your dataframe

### Solution

In [42]:
df['Final_Grade'] = ['Poor','Average','Good','Good']
df

       Math_Score  Phy_Score Final_Grade
Peter          45         16        Poor
Paul           77         50     Average
Mike           40         84        Good
Jane           85         23        Good

### Question 4: Add a new row to your dataframe

### Solution

In [45]:
#Not wishing to specify a unique row index name
df.loc[len(df.index)] = [100, 80, 'Excellent']
df

         Math_Score  Phy_Score Final_Grade
Peter            45         16        Poor
Paul             77         50     Average
Mike             40         84        Good
Jane             85         23        Good
4               100         80   Excellent
Solomon          10         20        Fail
6               100         80   Excellent

In [47]:
#Specify unique row index name

new_row = pd.Series({'Math_Score':10,'Phy_Score':20,'Final_Grade':'Fail'},name='Solomon')
df = df.append(new_row)

df

         Math_Score  Phy_Score Final_Grade
Peter            45         16        Poor
Paul             77         50     Average
Mike             40         84        Good
Jane             85         23        Good
4               100         80   Excellent
Solomon          10         20        Fail
6               100         80   Excellent
Solomon          10         20        Fail

### Question 5: Find the unique row in a column of your dataframe

### Solution:
Check for the unique final grade in the dataframe

In [26]:
print('The unique values in the Final Grade column are', df['Final_Grade'].unique())

The unique values in the Final Grade column are ['Poor' 'Average' 'Good' 'Very Good' 'Excellent' 'Fail']

### Question 6: Use the .nunique() method on your dataframe and report what you observe.

### Solution:

In [48]:
df['Final_Grade'].nunique()

5

### Report: 
Using the .nunique prints out only the total number of unique values and not the values themselves.

### Question 7: Drop a row and then a column from your dataframe

### Solution: We will drop the row with index 4 and the 'Final_Grade' column

In [49]:
#Drop row:

df.drop(4, inplace=True) # Ensure you use the inplace key word to effect your change

#df.drop(df.index[2], inplace = True) 

df

         Math_Score  Phy_Score Final_Grade
Peter            45         16        Poor
Paul             77         50     Average
Mike             40         84        Good
Jane             85         23        Good
Solomon          10         20        Fail
6               100         80   Excellent
Solomon          10         20        Fail

### Question 8: Use the .count() method on a column of your dataframe and report your answer

### Solution:

In [52]:
df['Math_Score'].count()

# This returns the total number of values in the column

7

### Question 9: Search for duplicate values in your dataframe

### Solution:

In [54]:
df.duplicated()

# We observe that the last index solomon report True, meaning its a duplicate row.

Peter      False
Paul       False
Mike       False
Jane       False
Solomon    False
6          False
Solomon     True
dtype: bool

### Question 10: Subset 2 columns from your dataframe and create a new dataframe from it.

### Solution:

In [56]:
df_new = df[['Math_Score','Final_Grade']]

df_new

         Math_Score Final_Grade
Peter            45        Poor
Paul             77     Average
Mike             40        Good
Jane             85        Good
Solomon          10        Fail
6               100   Excellent
Solomon          10        Fail

## Sign Out:

Thanks for checking out this notebook and I hope you have learn't something. Check out [@xtian4zy](https://twitter.com/@xtian4zy) on Twitter for Data Science, Machine Learning and AI classes and task.